In [1]:
import pandas as pd

data = {
    'account_number': [101, 102, 103, 104, 105],
    'holder_name': ['Ram', 'Krishna', 'Shiva', 'Ganesh', 'Sai'],
    'status': ['active', 'inactive', 'active', 'inactive', 'active']
}

df = pd.DataFrame(data)
df

   account_number holder_name    status
0             101         Ram    active
1             102     Krishna  inactive
2             103       Shiva    active
3             104      Ganesh  inactive
4             105         Sai    active

In [2]:
active_accounts = df[df['status'] == 'active']
print(active_accounts)

   account_number holder_name  status
0             101         Ram  active
2             103       Shiva  active
4             105         Sai  active

In [3]:
inactive_accounts = df[df['status'] == 'inactive']
print(inactive_accounts)

   account_number holder_name    status
1             102     Krishna  inactive
3             104      Ganesh  inactive

In [7]:
df.query("status == 'active'")

   account_number holder_name  status
0             101         Ram  active
2             103       Shiva  active
4             105         Sai  active

In [5]:
df.query("status == 'inactive'")

   account_number holder_name    status
1             102     Krishna  inactive
3             104      Ganesh  inactive

In [8]:
df[df['status'].isin(['active'])]

   account_number holder_name  status
0             101         Ram  active
2             103       Shiva  active
4             105         Sai  active

In [9]:
df[df['status'].isin(['active'])]

   account_number holder_name  status
0             101         Ram  active
2             103       Shiva  active
4             105         Sai  active